DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <registerRecords>AccumulationRegister.УспеваемостьСтудентов</registerRecords>
  <registerRecords>AccumulationRegister.Сессия</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/AccumulationRegisters/УспеваемостьСтудентов/УспеваемостьСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УспеваемостьСтудентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоОценокХорОтл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОценокЗачтено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОценокУдв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАкадемическихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomD/src/AccumulationRegisters/Сессия/Сессия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Сессия</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КолчиествоВыставленныхОценок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАкадемическихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроведенныхПереаттестаций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomD/src/Enums/ВидыОценокЗачет/ВидыОценокЗачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОценокЗачет</name>
  <enumValues>
    <name>Зачтено</name>
  </enumValues>
  <enumValues>
    <name>НеЗачтено</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УспеваемостьСтудентов 
	Движения.УспеваемостьСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокАттестационныхДисцилин Из СписокАттестационныхДисцилин Цикл
		Движение = Движения.УспеваемостьСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = ТекСтрокаСписокАттестационныхДисцилин.Семестр;
	Если ТекСтрокаСписокАттестационныхДисцилин.Оценка = 4 ИЛИ ТекСтрокаСписокАттестационныхДисцилин.Оценка = 5 Тогда 
			Движение.КоличествоОценокХорОтл = 1; 
		КонецЕсли; 
		Если ТекСтрокаСписокАттестационныхДисцилин.Оценка = Перечисления.ВидыОценокЗачет.Зачтено Тогда 
			Движение.КоличествоОценокЗачтено = 1; 
		КонецЕсли; 
		Если ТекСтрокаСписокАттестационныхДисцилин.Оценка = 3 Тогда 
			Движение.КоличествоОценокУдв = 1; 
		КонецЕсли; 
		Если ПустаяСтрока(ТекСтрокаСписокАттестационныхДисцилин) ИЛИ ТекСтрокаСписокАттестационныхДисцилин.Долг = Истина Тогда 
			Движение.КоличествоАкадемическихЗадолженностей = 1; 
		КонецЕсли; 	
	КонецЦикла;

	// регистр Сессия 
	Движения.Сессия.Записывать = Истина;
	Для Каждого ТекСтрокаСписокАттестационныхДисцилин Из СписокАттестационныхДисцилин Цикл
		Движение = Движения.Сессия.Добавить();
		Движение.Период = Дата;
		Движение.Семестр = ТекСтрокаСписокАттестационныхДисцилин.Семестр;
		Движение.Группа = Группа;
		Если ТекСтрокаСписокАттестационныхДисцилин.Оценка = 4 ИЛИ ТекСтрокаСписокАттестационныхДисцилин.Оценка = 5
			ИЛИ ТекСтрокаСписокАттестационныхДисцилин.Оценка = Перечисления.ВидыОценокЗачет.Зачтено ИЛИ ТекСтрокаСписокАттестационныхДисцилин.Оценка = 3  
			
			Тогда 
			Движение.КолчиествоВыставленныхОценок = 1;
		Иначе 
			Движение.КоличествоАкадемическихЗадолженностей = 1; 
		КонецЕсли;
		Если  ТекСтрокаСписокАттестационныхДисцилин.перезачтено = Истина Тогда 
			Движение.КоличествоПроведенныхПереаттестаций = 1; 
		КонецЕсли; 
		
	КонецЦикла; 
	
		
	
КонецПроцедуры
